---
type: AssetPropertyDoubleArray4d
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 5
tags: [revit-api, class]
---

# AssetPropertyDoubleArray4d

`Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetValueAsColor | 2018 | `public Color GetValueAsColor ()` |
| Method | GetValueAsDoubles | 2018 | `public IList < double > GetValueAsDoubles ()` |
| Method | IsValidValue | — | `` |
| Method | SetValueAsColor | 2018.1 | `public void SetValueAsColor ( Color color )` |
| Method | SetValueAsDoubles | 2018.1 | `public void SetValueAsDoubles ( IList < double > value )` |